InformationRegisters/МестаОсуществленияДеятельностиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаОсуществленияДеятельностиИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВетИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПодконтрольныхОбъектовВетИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМОД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаОсуществленияДеятельностиИСМП/Forms/ФормаВыбораЗначенийОтбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РанееВыбранныеЗначения = Новый Массив();
	Параметры.Свойство("ВыбранныеЗначения", РанееВыбранныеЗначения);
	
	ИмяЭлементаОтбора = "";
	Если Параметры.Свойство("ИмяЭлементаОтбора", ИмяЭлементаОтбора) Тогда
		Если ИмяЭлементаОтбора = "Владелец" Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Выбор владельца МОД'");
			Элементы.СтраницыВыбораЗначений.ТекущаяСтраница = Элементы.СтраницаВладелецМОД;
		ИначеЕсли ИмяЭлементаОтбора = "ТоварнаяГруппа" Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Выбор товарных групп'");
			Элементы.СтраницыВыбораЗначений.ТекущаяСтраница = Элементы.СтраницаТоварныеГруппы;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьРанееВыбранныеЗначения(РанееВыбранныеЗначения);
	СобытияФормИС.ПоляСоставногоТипаИнициализация(ЭтотОбъект, ИменаЭлементовПолейСоставногоТипа());
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВладелецМОД

&НаКлиенте
Процедура ВладелецМОДОрганизацияКонтрагентСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Элемент.ТекстРедактирования, ДанныеВыбора, Неопределено, 0, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецМОДОрганизацияКонтрагентСтрокойПриИзменении(Элемент)
	ПолеСоставногоТипаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецМОДОрганизацияКонтрагентСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецМОДОрганизацияКонтрагентСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТоварныеГруппы Цикл
		СтрокаТЧ.Выбрана = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТоварныеГруппы Цикл
		СтрокаТЧ.Выбрана = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	РезультатВыбора = Новый Массив;
	
	Если ИмяЭлементаОтбора = "ТоварнаяГруппа" Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Выбрана", Истина);
		НайденныеСтроки = ТоварныеГруппы.НайтиСтроки(ПараметрыОтбора);

		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			РезультатВыбора.Добавить(СтрокаТЧ.ТоварнаяГруппа);
		КонецЦикла;
		
	ИначеЕсли ИмяЭлементаОтбора = "Владелец" Тогда
		Для Каждого СтрокаТЧ Из ВладелецМОД Цикл
			РезультатВыбора.Добавить(СтрокаТЧ.ОрганизацияКонтрагент);
		КонецЦикла;
		
	КонецЕсли;
	
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРанееВыбранныеЗначения(СписокВыбранныхЗначений)
	
	Если ИмяЭлементаОтбора = "ТоварнаяГруппа" Тогда
		ЗаполнитьДоступныеТоварныеГруппы(СписокВыбранныхЗначений);
	ИначеЕсли ИмяЭлементаОтбора = "Владелец" Тогда
		Для каждого СтрокаЗначения Из СписокВыбранныхЗначений Цикл
			СтрокаТЧ = ВладелецМОД.Добавить();
			СтрокаТЧ.ОрганизацияКонтрагент = СтрокаЗначения;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеТоварныеГруппы(СписокУжеВыбранныхТоварныхГрупп)
	
	ДоступныеТоварныеГруппы = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ДоступныеТоварныеГруппыСВозможностьюРегистрацииМОД();
	
	Для Каждого ТоварнаяГруппа Из ДоступныеТоварныеГруппы Цикл
		НоваяСтрока = ТоварныеГруппы.Добавить();
		НоваяСтрока.ТоварнаяГруппа = ТоварнаяГруппа;
		НоваяСтрока.Выбрана = СписокУжеВыбранныхТоварныхГрупп.Найти(ТоварнаяГруппа) <> Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаАвтоПодбор(ЭтотОбъект,
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаПриИзменении(Элемент)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИменаЭлементовПолейСоставногоТипа()
	
	Возврат "ВладелецМОДОрганизацияКонтрагентСтрокой";
	
КонецФункции

&НаКлиенте
Процедура ПолеСоставногоТипаОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОкончаниеВыбора(ЭтотОбъект, Результат, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
